In [1]:
import pandas as pd

In [9]:
dataframe = pd.read_csv(r'D:/pandas/dataframeutf8.csv')

In [10]:
dataframe

  Nombre y Apellido  Edad       Pais Automovil
0              Juan    35     Mexico        No
1             Pedro    41   Honduras        Si
2             Maria    28       Peru        Si
3         Florencia    66  Argentina        No
4          Fernando    30  Argentina        Si
5             Paula    25     España        Si
6            Gimena    60   Colombia        No
7         Estefania    36      Chile        No
8          Agustina    27      Chile        No
9              Jose    34     España        Si

In [11]:
filtrar = dataframe[((dataframe.Pais == 'España') | (dataframe.Pais == 'Argentina')) & (dataframe.Automovil == 'Si' )]

In [12]:
filtrar

  Nombre y Apellido  Edad       Pais Automovil
4          Fernando    30  Argentina        Si
5             Paula    25     España        Si
9              Jose    34     España        Si

In [15]:
filtrar = dataframe[(dataframe.Pais == 'España') | (dataframe.Pais == 'Argentina')]

In [16]:
filtrar

  Nombre y Apellido  Edad       Pais Automovil
3         Florencia    66  Argentina        No
4          Fernando    30  Argentina        Si
5             Paula    25     España        Si
9              Jose    34     España        Si

In [23]:
agrupamos = filtrar.groupby(['Pais', 'Automovil']).size()#mostramos los registros q contengan los mismos datos, size muestra de una forma mas entendible

In [24]:
agrupamos

Pais       Automovil
Argentina  No           1
           Si           1
España     Si           2
dtype: int64

In [25]:
unstack = agrupamos.unstack('Automovil')#mostramos los registros mas agradables

In [20]:
unstack

Automovil   No   Si
Pais
Argentina  1.0  1.0
España     NaN  2.0